# NewViewSet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewViewSet Method
Application Class See Also
---
Creates a new instance of a View set.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ViewSet NewViewSet()
```

Visual Basic
---
```text
Public Function NewViewSet As ViewSet
```

Visual C++
---
```text
public:
ViewSet^ NewViewSet()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace